// Задание 1. С помощью цикла while вывести все простые числа в промежутке от 0 до 100
var p = 0;
while(p <= 100) {
	document.write (p + " ");
	p++;
}

if (p = 100) {
		document.write("<br>"+"<br>");
}

/* Задание 2. С помощью цикла do…while написать функцию для вывода чисел от 0 до 10, чтобы результат выглядел так:
0 – это ноль
1 – нечетное число
2 – четное число
3 – нечетное число
…
 10 – четное число*/

var n = 0;

do {
	if (n % 2 !== 0) {
		document.write(n + "- это нечетное число" + "<br>");
	}
	else if (n !== 0 && n % 2 === 0) {
		document.write(n + "- это четное число" + "<br>");
	}
	else {
		document.write(n + "- это ноль" + "<br>");
	}
	n++;
} while (n < 11);